# Anaconda

`conda create -n my-environment python=3.8` - создать окружение my-environment с питоном 3.8

`conda activate my-environment` - активировать окружение

`conda deactivate` - деактивировать окружение

`conda install numpy` - установка библиотеки

`conda env export --name my-environment > env.yml` - экспорт всех библиотек в yml файл

`conda env create --file env.yml` - создать окружение из файла env.yml

# Numpy

numpy позволяет оперировать матрицами и векторами

## Установка

В нужном окружении запустить

```
conda install numpy
```

Импортируем библиотеку

In [1]:
import numpy as np

Создаем массив из обычного списка python

In [2]:
test_list = [1, 2, 3]
array = np.array(test_list)
print(array, array.shape, len(array))

[1 2 3] (3,) 3

Генерируем разные массивы

In [3]:
np.arange(5)

array([0, 1, 2, 3, 4])

In [4]:
np.linspace(0, 10, 21)

array([ 0. ,  0.5,  1. ,  1.5,  2. ,  2.5,  3. ,  3.5,  4. ,  4.5,  5. ,
        5.5,  6. ,  6.5,  7. ,  7.5,  8. ,  8.5,  9. ,  9.5, 10. ])

Создаем матрицу из списка массива

In [5]:
matrix = [[1, 2, 3], [4, 5, 6]]
np_matrix = np.array(matrix)
print(np_matrix)
print(np_matrix.shape)

[[1 2 3]
 [4 5 6]]
(2, 3)

Пример работы reshape

In [6]:
np_matrix.reshape(3, 2)

array([[1, 2],
       [3, 4],
       [5, 6]])

In [7]:
np_matrix.reshape(-1, 1)

array([[1],
       [2],
       [3],
       [4],
       [5],
       [6]])

In [8]:
np_matrix.reshape(-1)

array([1, 2, 3, 4, 5, 6])

## Задача

Сгенерировать вектор из 100 элементов и превратить его в:

- матрицу 10x10
- вектор 1x100
- вектор 100x1

In [8]:
v = np.arange(100)
v1 = v.reshape(10, 10)
v2 = v.reshape(1, 100)
v3 = v.reshape(100, 1)
print(v1.shape, v2.shape, v3.shape)

(10, 10) (1, 100) (100, 1)

## Базовые операции

При помощи numpy можно легко делать любые простейшие операции над векторами и матрицами

In [9]:
a = np.array([20, 30, 40, 50])
b = np.arange(4)
b

array([0, 1, 2, 3])

In [ ]:
a + b

In [12]:
b ** 2

array([0, 1, 4, 9])

In [13]:
b < 2

array([ True,  True, False, False])

Выбираем все элементы меньше двух

In [14]:
b[b < 2]

array([0, 1])

In [10]:
A = np.array([[1, 1], [0, 1]])
B = np.array([[2, 0], [3, 4]])

Поэлементное произведение

In [16]:
A * B

array([[2, 0],
       [0, 4]])

Произведение матриц

In [17]:
A @ B

array([[5, 4],
       [3, 4]])

In [18]:
A.dot(B) # то же самое

array([[5, 4],
       [3, 4]])

Транспонирование

In [19]:
B

array([[2, 0],
       [3, 4]])

In [20]:
B.T

array([[2, 3],
       [0, 4]])

## Задача - Решение СЛАУ

$Ax = b$

Функция обратной матрицы - `np.linalg.inv(A)`

In [11]:
A = np.array([
    [3, -2],
    [5, 1]]
)
b = np.array([-6, 3])
# Решение - [0, 3]

In [12]:
a = np.linalg.inv(A)
x = a @ b
x

array([0., 3.])

Проверить себя можно при помощи `np.linalg.solve(A, b)` - функция решения СЛАУ

In [13]:
np.linalg.solve(A, b)

array([0., 3.])

Создание случайного массива

In [14]:
rand_arr = np.random.uniform(-1, 1, size=(2, 5))
rand_arr

array([[ 0.58948681, -0.08083728, -0.64438399, -0.80885509, -0.44881453],
       [ 0.80457049,  0.60716861,  0.35596999,  0.02972721, -0.77354395]])

In [22]:
rand_arr[rand_arr > 0]

array([0.5369102 , 0.48257583, 0.98335769, 0.29779659])

Считаем сумму по строкам/столбцам

In [26]:
rand_arr.sum(axis=0) # суммируем по столбцам

array([ 0.7657134 ,  1.02018964, -0.16895717, -0.65215687, -0.08715986])

In [27]:
rand_arr.sum(axis=1)  # суммируем по строкам

array([-0.09373285,  0.97136199])

Находим минимум максимум во всем массиве и по строкам/столбцам

In [28]:
rand_arr.max(), rand_arr.min()

(0.9000195890450371, -0.9852819544981997)

In [29]:
rand_arr.max(axis=0)

array([0.69286493, 0.90001959, 0.81632479, 0.02709793, 0.59793585])

Также можно применять любые математические операции к массиву

In [30]:
np.sqrt(rand_arr)

/var/folders/0m/83cqwzds7rd6z7tfxp_w6nsm2j0dkz/T/ipykernel_20897/4099335953.py:1: RuntimeWarning: invalid value encountered in sqrt
  np.sqrt(rand_arr)

array([[0.26990456, 0.94869362,        nan,        nan, 0.77326312],
       [0.83238508, 0.34665552, 0.90350694, 0.1646145 ,        nan]])

In [31]:
np.exp(rand_arr)

array([[1.07556754, 2.45965129, 0.37333395, 0.50699466, 1.81836156],
       [1.99943558, 1.1276886 , 2.26217058, 1.02746842, 0.50404198]])

In [32]:
np.log(rand_arr)

/var/folders/0m/83cqwzds7rd6z7tfxp_w6nsm2j0dkz/T/ipykernel_20897/772721215.py:1: RuntimeWarning: invalid value encountered in log
  np.log(rand_arr)

array([[-2.61937375, -0.10533875,         nan,         nan, -0.5142718 ],
       [-0.36692021, -2.11884744, -0.20294298, -3.60829784,         nan]])

## Задача

Сгенерировать случайную матрицу и посчитать сумму положительных элементов в каждой строке, в каждом столбце.

In [32]:
rand_arr = np.random.uniform(-1, 1, size=(3, 4))
rand_arr[rand_arr < 0] = 0
rand_arr.sum(axis=0)

array([0.        , 0.        , 1.78231208, 0.77744001])

In [31]:
rand_arr.sum(axis=1)

array([1.1718495 , 0.1804955 , 1.79210779])

## Индексация

Индексация по массивам numpy похожа на индексацию по спискам python, но шире и гибче

Общий синтаксис:

`a[start:stop:step]`

Аргументы можно пропускать, тогда будут взятые аргументы по-умолчанию. Например:

`a[:] == a[0:len(a):1]`

In [34]:
a = np.arange(10)

Выбираем один элемент

In [35]:
a[2]

2

Берем подмассив

In [36]:
a[2:5]

array([2, 3, 4])

Подмассив с заданным шагом

In [37]:
a[:6:2]

array([0, 2, 4])

In [38]:
a[:6:2] = 1000
a

array([1000,    1, 1000,    3, 1000,    5,    6,    7,    8,    9])

In [39]:
a[::-1]

array([   9,    8,    7,    6,    5, 1000,    3, 1000,    1, 1000])

Возьмем матрицу из случайных целых чисел

In [40]:
arr = np.random.randint(1, 5, size=(3, 5))
arr

array([[2, 2, 3, 3, 1],
       [3, 2, 2, 2, 4],
       [2, 1, 3, 3, 2]])

In [41]:
arr[2]

array([2, 1, 3, 3, 2])

По матрицам можно индексироваться отдельно по каждой оси через запятую

Сначала указываем индекс для строк, потом для колонок

In [42]:
a = [1, 2, 3]

a = map(lambda x: x + 2, a)
list(a)

[3, 4, 5]

In [43]:
arr[1:, :2]

array([[3, 2],
       [2, 1]])

In [44]:
arr[::-1, ::2] = 0
arr

array([[0, 2, 0, 3, 0],
       [0, 2, 0, 2, 0],
       [0, 1, 0, 3, 0]])

In [45]:
arr[-1]

array([0, 1, 0, 3, 0])

In [46]:
arr[:, :]

array([[0, 2, 0, 3, 0],
       [0, 2, 0, 2, 0],
       [0, 1, 0, 3, 0]])

Генерируем матрицы

In [47]:
np.ones((3, 3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [48]:
np.zeros((3, 3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [49]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

## Задача

Вывести матрицу из нулей и единиц в шахматном порядке

In [50]:
# Ваш код здесь

## Расширяем массивы

In [51]:
a = np.arange(10)
b = a + 1

In [52]:
a.shape, b.shape

((10,), (10,))

Соединям по горизонтали

In [53]:
np.hstack((a, b)).shape

(20,)

Соединяем по вертикали

In [54]:
np.vstack((a, b)).shape

(2, 10)

In [55]:
np.hstack((a, [1]))

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 1])

Расширение массива в numpy происходит путем создания нового массива.

Поэтому если требуется сгенерировать массив, то лучше сделать это через список, а дальше сделать из него массив numpy

In [56]:
%%timeit

a = np.arange(10)
for i in range(1000):
    a = np.hstack((a, 1))
a.shape

1.45 ms ± 30.3 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [57]:
%%timeit

a = list(range(10))
for i in range(1000):
    a.append(i)
np.array(a).shape

59 µs ± 443 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

## Сравниваем скорость list и np.array

In [58]:
%%timeit

[i * i for i in range(100000)]

3.55 ms ± 78.5 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [59]:
%%timeit

a = np.arange(100000)
a * a

47.2 µs ± 315 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

# Pandas

 Позволяет работать с данными - читать, преобразовывать и сохранять

 ## Установка

 ```
 conda install pandas
 ```

In [60]:
import pandas as pd

## Series

Series - столбец в таблице.

Он состоит из индекса ("имена" строк) и значений. По-умолчанию индекс - уникальные числа от 0 до длины списка.

Создавать series можно из списка или массива numpy.

In [61]:
series = pd.Series([1, 2, 3])
series

0    1
1    2
2    3
dtype: int64

In [62]:
series.index

RangeIndex(start=0, stop=3, step=1)

In [63]:
series.values

array([1, 2, 3])

Индекс может быть строкой

In [64]:
legs_counter = pd.Series([4, 4, 8], index=["cat", "dog", "spider"])
legs_counter

cat       4
dog       4
spider    8
dtype: int64

По series можно индексирования при помощи `loc` и `iloc`

- `loc` - если хотим взять по индексу
- `iloc` - если хотим взять по порядковому номеру

In [65]:
legs_counter.iloc[2]

8

In [66]:
legs_counter.loc["dog"]

4

In [67]:
legs_counter.unique()

array([4, 8])

## DataFrame

DataFrame - набор Series, то есть таблица.

Индекс для датафрейма - названия строк

Колонки - названия столбцов (series)

In [68]:
ages = [25, 35, 45]
heights = [170, 180, 190]
names = ["Alex", "Polina", "Misha"]
data = {'age': ages, 'height': heights, 'name': names}
df = pd.DataFrame(data)
df

   age  height    name
0   25     170    Alex
1   35     180  Polina
2   45     190   Misha

In [69]:
df['age']  #Получился Series

0    25
1    35
2    45
Name: age, dtype: int64

In [70]:
df[['age', 'height']] #Получился DataFrame

   age  height
0   25     170
1   35     180
2   45     190

In [71]:
df[['age']] # Получился DataFrame

   age
0   25
1   35
2   45

Можно добавить новую колонку

In [72]:
df['height/age'] = df['height'] / df['age']
df

   age  height    name  height/age
0   25     170    Alex    6.800000
1   35     180  Polina    5.142857
2   45     190   Misha    4.222222

In [73]:
df["age"].sum()
df["age"].min()
df["age"].max()
df["age"].mean()

35.0

Можно взять содержимое датафрейма как набор numpy-массивов

In [74]:
df.values

array([[25, 170, 'Alex', 6.8],
       [35, 180, 'Polina', 5.142857142857143],
       [45, 190, 'Misha', 4.222222222222222]], dtype=object)

Можно фильтровать датафреймы

In [75]:
df[df['age'] == 25]

   age  height  name  height/age
0   25     170  Alex         6.8

In [76]:
df[(df['age'] > 35) & (df['height'] > 170)]

   age  height   name  height/age
2   45     190  Misha    4.222222

Если нужно поменять какое-то значение, можно использовать [.loc](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy)

In [77]:
df.loc[df['age'] == 25, 'age'] = 20

In [78]:
df[df['height/age'] > 5]

   age  height    name  height/age
0   20     170    Alex    6.800000
1   35     180  Polina    5.142857

Создадим категорию "высокий", если человек выше 175, а иначе "низкий"

In [79]:
df["height_category"] = df["height"].apply(lambda x: "высокий" if x > 175 else "низкий")
df

   age  height    name  height/age height_category
0   20     170    Alex    6.800000          низкий
1   35     180  Polina    5.142857         высокий
2   45     190   Misha    4.222222         высокий

In [80]:
df[(df['height_category'] == "высокий") & (df['age'] > 40)]

   age  height   name  height/age height_category
2   45     190  Misha    4.222222         высокий

## Задача

Посчитать средний рост для высоких людей

In [81]:
# Ваш код здесь

## Пропуски в данных

Часто в реальных данных есть пропуски. Их надо либо убирать, либо заполнять

In [82]:
values = [[None, 1, 2], [None, 2, 3], [None, None, 4]]
df = pd.DataFrame(values, columns=["a", "b", "c"])
df

      a    b  c
0  None  1.0  2
1  None  2.0  3
2  None  NaN  4

За удаление отвечает функция `dropna()`

У dropna есть два важных аргумента:

- axis (по-умолчанию 0) - по строкам или по колонкам будем искать наны
- how (по-умолчанию 'any') - бывает any и all, ниже пример использования

Удаляем столбец `a`, потому что в нем все (all) значения None

Сохраним датафрейм, он понадобится ниже

In [83]:
dropped_a = df.dropna(axis=1, how='all')
dropped_a

     b  c
0  1.0  2
1  2.0  3
2  NaN  4

Удаляем столбцы `a` и `b`, потому что в них есть None (any)

In [84]:
df.dropna(axis=1, how='any')

   c
0  2
1  3
2  4

Возьмем датафрейм выше. Удалим из него последнюю строку, так как в ней есть None

In [85]:
dropped_a.dropna(axis=0, how='any')

     b  c
0  1.0  2
1  2.0  3

Заполним пустые значения 0

In [86]:
df.fillna(0)

   a    b  c
0  0  1.0  2
1  0  2.0  3
2  0  0.0  4

Заполним последним известным значением

In [87]:
df.fillna(method="ffill")
# Тоже самое, что и df.ffill()

      a    b  c
0  None  1.0  2
1  None  2.0  3
2  None  2.0  4

Заполним средним между соседними известными значениями

In [88]:
df.interpolate()

      a    b  c
0  None  1.0  2
1  None  2.0  3
2  None  2.0  4

## Работаем с данными

Мы можем прочитать таблицу из разных форматов: Excel, CSV, TSV, HDF и т.д.

Начнем с самого простого формата - CSV. Можно открыть в блокноте файл `data/weather.csv` и посмотреть как он выглядит.

Чтобы загрузить файл в DataFrame, воспользуемся методом `pd.read_csv()`

In [89]:
df = pd.read_csv('../data/weather.csv')
df.head()

          Day   t
0  2008-01-01   0
1  2008-01-02  -5
2  2008-01-03 -11
3  2008-01-04 -11
4  2008-01-05 -12

In [90]:
df.describe()

                 t
count  3285.000000
mean      8.137595
std      10.403138
min     -23.000000
25%       1.000000
50%       8.000000
75%      17.000000
max      34.000000

In [91]:
df["Day"] = pd.to_datetime(df["Day"])
df["year"] = df.Day.dt.year
df["month"] = df.Day.dt.month
df["day"] = df.Day.dt.day
df.head()

         Day   t  year  month  day
0 2008-01-01   0  2008      1    1
1 2008-01-02  -5  2008      1    2
2 2008-01-03 -11  2008      1    3
3 2008-01-04 -11  2008      1    4
4 2008-01-05 -12  2008      1    5

## Задача

Вывести среднюю температуру за январь 2010 года

In [92]:
# Ваш код здесь

## Группировка и агрегация данных

Иногда нужно объединять строки, в которых есть какие-то одинаковые значения.

Например, мы хотим посчитать среднюю температуру для каждого месяца. Это значит, что нам нужны строки, в которых совпадают year и month

In [93]:
for name, group in df.groupby(["year", "month"]):
    print(name)
    print(group.head(2))
    break

(2008, 1)
         Day  t  year  month  day
0 2008-01-01  0  2008      1    1
1 2008-01-02 -5  2008      1    2

In [94]:
df.groupby(["year", "month"]).mean()

                    t        day
year month
2008 1      -1.612903  16.000000
     2       0.034483  15.000000
     3       1.516129  16.000000
     4       9.566667  15.500000
     5      14.133333  16.333333
...               ...        ...
2016 8      19.161290  16.000000
     9      14.366667  15.500000
     10      5.870968  16.000000
     11     -1.433333  15.500000
     12     -0.806452  16.000000

[108 rows x 2 columns]

Вопрос - почему среднее по дням разное?

Иногда мы хотим применить какую-то функцию, которой нет в стандартном pandas или хотим применить много разных функций к определенным строкам. Для этого существует метод agg (сокращение от Aggregate)

In [95]:
df.groupby(["month"]).agg(['mean', 'max', 'std']) # Применяем много функций ко всем столбцам

/var/folders/0m/83cqwzds7rd6z7tfxp_w6nsm2j0dkz/T/ipykernel_20897/2690716170.py:1: FutureWarning: ['Day'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby(["month"]).agg(['mean', 'max', 'std']) # Применяем много функций ко всем столбцам

               t                       year                        day      \
            mean max       std         mean   max       std       mean max
month
1      -5.745520   5  6.316853  2012.000000  2016  2.586629  16.000000  31
2      -3.505882   6  5.953805  2012.000000  2016  2.596181  14.670588  29
3       0.759857  13  4.252342  2012.000000  2016  2.586629  16.000000  31
4       7.744444  21  4.167214  2012.000000  2016  2.586784  15.500000  30
5      15.291367  30  5.149533  2012.014388  2016  2.580084  16.035971  31
6      18.325926  31  4.513227  2012.000000  2016  2.586784  15.500000  30
7      21.949640  33  4.418249  2012.003597  2016  2.590594  15.946043  31
8      19.666667  34  4.102114  2012.000000  2016  2.586629  16.000000  31
9      14.574074  24  3.318316  2012.000000  2016  2.586784  15.500000  30
10      7.326165  16  3.501962  2012.000000  2016  2.586629  16.000000  31
11      2.466667  11  4.134001  2012.000000  2016  2.586784  15.500000  30
12     -1.823741   8  5.425692  2012.000000  2016  2.591293  16.000000  31


            std
month
1      8.960344
2      8.196967
3      8.960344
4      8.671515
5      8.956300
6      8.671515
7      8.930981
8      8.960344
9      8.671515
10     8.960344
11     8.671515
12     8.976504

In [96]:
# применяем много функций к определенным столбцам
df.groupby(["month"]).agg({'t':['count','mean','max','min'],'day':['mean']})

          t                           day
      count       mean max min       mean
month
1       279  -5.745520   5 -21  16.000000
2       255  -3.505882   6 -23  14.670588
3       279   0.759857  13 -11  16.000000
4       270   7.744444  21  -1  15.500000
5       278  15.291367  30   3  16.035971
6       270  18.325926  31   9  15.500000
7       278  21.949640  33  12  15.946043
8       279  19.666667  34  10  16.000000
9       270  14.574074  24   5  15.500000
10      279   7.326165  16  -2  16.000000
11      270   2.466667  11 -13  15.500000
12      278  -1.823741   8 -19  16.000000

In [97]:
df.groupby(["month"]).agg(
    {'t':[
        ('one',  np.mean), 
        ('two', lambda value: 100 * ((value>32).sum() / value.std())), 
        ('three', lambda value: 100* ((value > 45).sum() / value.mean()))
    ]}
)

               t
             one        two three
month
1      -5.745520   0.000000  -0.0
2      -3.505882   0.000000  -0.0
3       0.759857   0.000000   0.0
4       7.744444   0.000000   0.0
5      15.291367   0.000000   0.0
6      18.325926   0.000000   0.0
7      21.949640  22.633403   0.0
8      19.666667  24.377675   0.0
9      14.574074   0.000000   0.0
10      7.326165   0.000000   0.0
11      2.466667   0.000000   0.0
12     -1.823741   0.000000  -0.0

## Функция map

In [98]:
month_number_to_name = {
    1: "Январь",
    2: "Февраль",
    3: "Март",
    4: "Апрель",
    5: "Май",
    6: "Июнь",
    7: "Июль",
    8: "Август",
    9: "Сентябрь",
    10: "Октябрь",
    11: "Ноябрь",
    12: "Декабрь"
}

In [99]:
df["month_name"] = df["month"].map(month_number_to_name)
df.head()

         Day   t  year  month  day month_name
0 2008-01-01   0  2008      1    1     Январь
1 2008-01-02  -5  2008      1    2     Январь
2 2008-01-03 -11  2008      1    3     Январь
3 2008-01-04 -11  2008      1    4     Январь
4 2008-01-05 -12  2008      1    5     Январь

Сохраним результаты

## Функций apply

In [100]:
df['T_f'] = df.t.apply(lambda x: 9/5 * x + 32)
df.head()

         Day   t  year  month  day month_name   T_f
0 2008-01-01   0  2008      1    1     Январь  32.0
1 2008-01-02  -5  2008      1    2     Январь  23.0
2 2008-01-03 -11  2008      1    3     Январь  12.2
3 2008-01-04 -11  2008      1    4     Январь  12.2
4 2008-01-05 -12  2008      1    5     Январь  10.4

In [101]:
df.to_csv('result.csv')

## Задача

**Во всех задачах ниже стараемся избегать циклов**


Найти насколько отличалась температура в самый жаркий и самый холодный день

## Задача

Вывести среднее, максимальное, минимальное, стандартное отклонение и медиану температуры за каждый год

## Задача

Необходимо узнать насколько медиана отличалась от среднего в каждом месяце. Использовать agg для решения

## Задача

Вывести день, в который максимально изменилась температура

Подсказка: `diff()`

In [102]:
# Ваш код здесь

## Поработаем с экселем

Сохраним датафрейм в эксель

In [103]:
df.to_excel('../data/excel.xlsx')

Прочитаем из экселя

In [104]:
pd.read_excel('../data/excel.xlsx', index_col=0)

            Day   t  year  month  day month_name   T_f
0    2008-01-01   0  2008      1    1     Январь  32.0
1    2008-01-02  -5  2008      1    2     Январь  23.0
2    2008-01-03 -11  2008      1    3     Январь  12.2
3    2008-01-04 -11  2008      1    4     Январь  12.2
4    2008-01-05 -12  2008      1    5     Январь  10.4
...         ...  ..   ...    ...  ...        ...   ...
3280 2016-12-27   1  2016     12   27    Декабрь  33.8
3281 2016-12-28  -3  2016     12   28    Декабрь  26.6
3282 2016-12-29   0  2016     12   29    Декабрь  32.0
3283 2016-12-30   3  2016     12   30    Декабрь  37.4
3284 2016-12-31   4  2016     12   31    Декабрь  39.2

[3285 rows x 7 columns]

In [106]:
import os
os.remove('../data/excel.xlsx')
os.remove('result.csv')

# Полезные ссылки

- [Git](https://git-scm.com/downloads)

- [Anaconda](https://www.anaconda.com/products/individual#Downloads)

- [VS Code](https://code.visualstudio.com/download)

- [Шпаргалка по анаконде](https://docs.conda.io/projects/conda/en/4.6.0/_downloads/52a95608c49671267e40c689e0bc00ca/conda-cheatsheet.pdf)

- [Шпаргалка по гиту](https://education.github.com/git-cheat-sheet-education.pdf)

- [Установка jupyterlab (вариант с conda install, не забываем активировать окружение)](https://jupyterlab.readthedocs.io/en/stable/getting_started/installation.html)

- [Небольшой курс по numpy-pandas-matplotlib, если хочется интерактивных задач](https://www.sololearn.com/learning/1161)